infra/kaggle/kernel_openfoam_xfid_v16_jammy/case_template/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p { solver GAMG; tolerance 1e-7; relTol 0.01; smoother GaussSeidel; }
    "U" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0.1; }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
    pRefCell 0;
    pRefValue 0;

    // Stage V qualification (docs/problem_resolution_plan_2026_09.md C7 point 2): explicit
    // residualControl so a run that merely completes the endTime is never treated as
    // converged. Thresholds are pre-registered in cfd.STAGE_V_QUALIFICATION_PROFILE_V1.
    residualControl
    {
        p 1e-5;
        U 1e-6;
    }
}

relaxationFactors
{
    fields { p 0.2; }
    equations { U 0.5; }
}
